package com.zdw.test.generator;


import com.zdw.test.util.RandomUtil;

/**
 * 随机生成中文姓名
 * 代码源于网络 由kingYiFan整理  create2019/05/24
 */
public class NameGenerator {
  
   private static String[] surname = new String[]{"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫",
                                                    "沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔",
                                                    "严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水",
                                                    "章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌",
                                                    "苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐",
                                                    "廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝",
                                                    "安","常","乐","于","时","傅","皮","卞","齐","康","伍","余",
                                                    "卜","顾","孟","平","黄","和","穆","萧","尹","姚","邵","湛",
                                                    "祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴",
                                                    "宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁","杜",
                                                    "蓝","闵","席","季","麻","强","贾","路","娄","危","江","童",
                                                    "郭","梅","盛","林","刁","钟","徐","邱","骆","高","夏","蔡",
                                                    "樊","胡","凌","霍","虞","万","支","柯","咎","管","卢","莫",
                                                    "房","裘","缪","干","解","应","宗","宣","丁","贲","邓","郁",
                                                    "杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇",
                                                    "滑","裴","陆","荣","翁","荀","羊","於","惠","甄","魏","加",
                                                    "芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫",
                                                    "焦","巴","弓","牧","隗","山","谷","车","侯","宓","蓬","全",
                                                    "班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭",
                                                    "戎","祖","武","符","刘","姜","詹","束","龙","叶","幸","司",
                                                    "郜","黎","蓟","薄","印","宿","白","怀","蒲","台","从","鄂",
                                                    "咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","郁","胥",
                                                    "苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申",
                                                    "堵","冉","宰","郦","雍","却","璩","桑","桂","濮","牛","寿",
                                                    "边","扈","燕","冀","郏","浦","尚","农","温","别","庄","晏",
                                                    "瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容","向",
                                                    "易","慎","戈","廖","庚","终","暨","居","衡","步","都","耿",
                                                    "弘","匡","国","文","寇","广","禄","阙","东","殴","殳","沃",
                                                    "蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融",
                                                    "訾","辛","阚","那","简","饶","空","曾","毋","沙","乜","养",
                                                    "须","丰","巢","关","蒯","相","查","后","江","红","游","竺",
                                                    "逯","盖","益","桓","公","万","俟","司","马","上","官","欧",
                                                    "夏","侯","诸","葛","闻","人","东","方","赫","连","皇","甫",
                                                    "迟","公","羊","澹","台","公","冶","宗","政","濮","阳","淳",
                                                    "仲","孙","太","叔","申","屠","公","孙","乐","正","轩","辕",
                                                    "狐","钟","离","闾","丘","长","孙","慕","容","鲜","于","宇",
                                                    "司","徒","司","空","亓","官","司","寇","仉","督","子","车",
                                                    "孙","端","木","巫","马","公","西","漆","雕","乐","正","壤",
                                                    "公","良","拓","拔","夹","谷","宰","父","谷","粱","晋","楚",
                                                    "法","汝","鄢","涂","钦","段","干","百","里","东","郭","南",
                                                    "呼","延","归","海","羊","舌","微","生","岳","帅","缑","亢",
                                                    "后","有","琴","梁","丘","左","丘","东","门","西","门","商",
                                                    "佘","佴","伯","赏","南","宫","墨","哈","谯","笪","年","爱",
                                                    "佟","东方","夏侯","诸葛","尉迟","皇甫","宇文","鲜于","西门",
                                                    "司马","独孤","公孙","慕容","轩辕","左丘","欧阳","皇甫","上官",
                                                    "欧阳","太史","端木","上官","司马","东方","独孤","南宫","万俟",
                                                    "闻人","夏侯","诸葛","尉迟","公羊","赫连","澹台","皇甫","宗政",
                                                    "濮阳","公冶","太叔","申屠","公孙","慕容","仲孙","钟离","长孙",
                                                    "宇文","司徒","鲜于","司空","闾丘","子车","亓官","司寇","巫马",
                                                    "公西","颛孙","壤驷","公良","漆雕","乐正","宰父","谷梁","拓跋",
                                                    "夹谷","轩辕","令狐","段干","百里","呼延","东郭","南门","羊舌",
                                                    "微生","公户","公玉","公仪","梁丘","公仲","公上","公门","公山",
                                                    "公坚","左丘","公伯","西门","公祖","第五","公乘","贯丘","公皙",
                                                    "南荣","东里","东宫","仲长","子书","子桑","即墨","达奚","褚师",
                                                    "吴铭","闾丘","令狐"};


    //女生名
    private static String girlName = "文明华玉晓云海芳丽林英佳红宇君子慧秀玲嘉婷敏立雅美清梅怡惠欣燕凤智萍佩艳兰娟雪淑珍静如青思霞秋雯颖宜芬" +
            "宁琳一洁莹桂瑜琪莉琴涵恩雨书珊锦顺郁源星钰心丹梦茹鑫霖芸真容琼莲晨萱盈芝慈婉琦素吉奕巧睿翠益倩馨薇媛毓" +
            "璇南纯贞喜菁筱依若亭羽菊泉晴妮桦旻虹之湘钦可碧姿双礼瑄楠凌柔沛怀卿于绮昕妤竹瑶韵伊程蕙昀善炜希然翊珠晶" +
            "冰焕娇来筠乔妍祐宣易舒晖婕玟艺致芹芷亦曼铃闵意汝迪宛千祺灵彤娴岚洲玫菲茜瑛姗懿瑾润悦蓁苹卓琬幸俐蕾蔚卉" +
            "微璐蓓忆雁采欢占西尹融甄露楚惟茵念琇梓谊汶相熙谕路菱允照翎淇婧言黎屏斐贝笑声璟亿纹苗恬音渝小韶媚语余献" +
            "萌滢艾榆苓晔唯珈苑葳予姵姣澄歆霈馥幼蕊姝芯桐非颐苇喻影盼玥肖芃慕暄樱珺芊霜逢耘沂知苡菀骐沁孜茗懋靓嫣隽" +
            "珂旋忻薰祈霓愉谨俪芮荷薏蓝涓珏蕴眉淼珩冉镜霏嬿蔓菡丝晗优璁莺辛缘熹芙芩偲畅漫漪竺黛葵沐霙佾奂凝鹃澍温莞" +
            "澜葆颀湄煦姮霁俏迅瑢缙荟喆萃镕悠尤旖憬晞瑷忱莳纾识旎禛衿濡惜旼蘅嬛藜湉苒玙";
  
    //男生名
    private static String boyName = "文明华志伟国建平杰海林德永宇荣俊军家龙成世东宏新庆辉瑞安祥峰正忠元维强良凯振兴彦仁学中宗利福民宝天玮昌" +
            "斌飞胜鹏少勇铭洪贤波超亮哲鸿翔豪松一浩江泽长群义庭涛政富贵轩柏阳健旭刚廷圣培达山坤伦诗逸毅升方和雄星钰" +
            "娜冠汉信绍继发恒传佑奇吉朝兵根兆仲儒勋才昱康扬祖进先敬裕克连凡洋丰诚弘翰茂南万皓盛孝均靖辰乐修力延权伯" +
            "淳泰昭崇宪咏勤章仕尚道聪川开品骏尧纬炳高岳秉韦麟治晋隆磊程昀运风科名任来虎谦乔祯帆宣展栋峻向旺邦跃昆业" +
            "加以增显鸣千迪岚捷奎守泓丞京硕腾本年舜雷渊乃齐堂紫航宽甫煜至原朋臻城卓坚瀚同登纪岩禹楷镇寿昊晟存恺楚念" +
            "太震灿鼎能得宸照煌行钟夫柱杨百彪厚铨炎麒自竣河久时滨法彰桓又呈玄令标常迎理典函上枫瑀津作岱梁岑琮鹤劭重" +
            "羿禄尔介烨夏锐绪肇巍征合佐劲曜经侑曦格越从贺赛钊衍嵩铮功霆魁训蒙昶前侠寒聿潇玺端琛谷炫含则里乾胤骅砚济" +
            "申崴纮敦净再禾浚起多寅庚牧化誉资殿普雍仰炯复联韬昂琨寰必望冲赞沅贻述召盟颂翼秦北铠繁洛霄慎闻倍律杉濬玠" +
            "洛诺轶效在柯璧右甲颢实璞严曙翌今峥啸御颉朗铎深赫焱丛侃嵘仑竞谋祎井灏炘汇倚彧珣圻证策临屹戎琰享驰惇诠励" +
            "助步弼钲领陶后曾图贯吾积榛默朴睦施诒锴夙习竑滔丕璨拓际冀骞谆襄诣湛栩溥羲箴擎嗣玹熠枢佰朔淙缇岸孚异彻祉" +
            "择镛梧镐恪鋆俨粲琢蔼郅兢企铂谟楙炅瞻遐慷衢铄稔挚诤" ;

    /**
     * 生成中文名称
     *
     * @return
     */
    public static String getChineseName(int sex) {
        int index = RandomUtil.getNum(0, surname.length - 1);
        String first = surname[index];

        String str = boyName;
        int length = boyName.length();
        if (sex == 0) {
            str = girlName;
            length = girlName.length();
        }
        index = RandomUtil.getNum(0, length - 1);
        String second = str.substring(index, index + 1);
        int hasThird = RandomUtil.getNum(0, 1);
        String third = "";
        if (hasThird == 1) {
            index = RandomUtil.getNum(0, length - 1);
            third = str.substring(index, index + 1);
        }
        return first + second + third;
    }

    public static void main(String[] args) {
        for (int i = 1; i < 1001; i++) {
            System.out.print(getChineseName(RandomUtil.getNum(0,1))+" ");
            if(i%10==0){
                System.out.println("");
            }
        }
    }
}